# KipsPerInch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipsPerInch Property
UnitTypeId Class See Also
---
Kips per inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipsPerInch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipsPerInch As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipsPerInch {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace